package pkg1;

public class Main {

	public static void main(String[] args) {
		/* 6월 19일(월) ~ 6월 25일(일) 회고록
		 * 
		 * 이번 주 웹소켓을 맨땅에 헤딩하며 만들었다. 진짜 열심히 했는데
		 * 너무 막 만들어가지고 그런가 연결하기가 정말 쉽지 않았다.
		 * 그렇다고 해서 기능이 안되지 않았다.
		 * 
		 * 결국 비동기로(ajax)로 밖에 대화를 성공하지 못했다.
		 * 
		 * 그래서 아예 새로 웹소켓을 갈아엎어버리기로 헀다.
		 * 뭐 오늘 일요일 죽어라 해야지.
		 * 
		 * 방금 네트워크관리사 2급 실기 시험을 보고 왔는데,
		 * 음~~~ 잘 모르겠다 ^^ 노력했으니 좋은 결과 있길 바랄 뿐이다.
		 * 
		 * 이제 다시 인프런 자바 알고리즘 강의 하나 듣고 바로 웹소켓 시작해야겠다.
		 * 정말 바쁘다 바빠~ 직장 다닐 때보다 훨씬!
		 * 그렇지만, 보람있다. 내 자신이 하루하루 이렇게 갈고 닦여나가는 모습이 뿌듯하고
		 * 뒤돌아보면 정말 아무것도 몰랐던 내가 이렇게 많이 왔어? 생각할정도로 쾌감이 있다.
		 * 
		 * 오늘도 열심히 해야지! 힘내자 정원아 화이팅!!!
		 * 
		 * 
		 */
	}

}
